Revit 2024 API
BuiltInFailures.RoofFailures.ExtrudedRoofCutBySketch Property
 Entire extruded Roof is cut by cut Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ExtrudedRoofCutBySketch { get; }
Visual Basic
Public Shared ReadOnly Property ExtrudedRoofCutBySketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ExtrudedRoofCutBySketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace